In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry', 'rohan', 'skillf', 'subha'],
    "mark":[92, 34, 24, 17],
    "city":['rampur', 'kolkata', 'barelly','balasore']
}

## Convert the given dictionary in to dataframe

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  mark      city
0   harry    92    rampur
1   rohan    34   kolkata
2  skillf    24   barelly
3   subha    17  balasore

## Convert the dataframe into csv file or any type of file i.e. Excel file

In [5]:
df.to_csv('friend.csv')

In [6]:
df.to_csv('friend_indexFalse.csv', index=False)

In [7]:
df.head(2) # To show first two rows

    name  mark     city
0  harry    92   rampur
1  rohan    34  kolkata

In [8]:
df.tail(2) # To show last two rows

     name  mark      city
2  skillf    24   barelly
3   subha    17  balasore

In [9]:
df.describe() # To describe the numerical values of the data set

           mark
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [10]:
df

     name  mark      city
0   harry    92    rampur
1   rohan    34   kolkata
2  skillf    24   barelly
3   subha    17  balasore

## To change a content in the csv file

In [11]:
df['name'][0] = 'Bubu'

C:\Users\mebub_9a7jdi8\AppData\Local\Temp\ipykernel_1704\2341372380.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][0] = 'Bubu'

In [12]:
df

     name  mark      city
0    Bubu    92    rampur
1   rohan    34   kolkata
2  skillf    24   barelly
3   subha    17  balasore

## To change the Index number

In [13]:
df.index = ['first', 'second', 'third', 'fourth']

In [14]:
df

          name  mark      city
first     Bubu    92    rampur
second   rohan    34   kolkata
third   skillf    24   barelly
fourth   subha    17  balasore

## How to print a series

In [15]:
ser = pd.Series(np.random.rand(34))

In [16]:
ser

0     0.087777
1     0.716518
2     0.891623
3     0.920956
4     0.021763
5     0.061269
6     0.936575
7     0.547374
8     0.548745
9     0.606563
10    0.833459
11    0.866760
12    0.167369
13    0.016363
14    0.461033
15    0.080240
16    0.680703
17    0.712014
18    0.189412
19    0.750495
20    0.472338
21    0.735751
22    0.451301
23    0.581813
24    0.487514
25    0.483375
26    0.413177
27    0.475620
28    0.032223
29    0.594331
30    0.743522
31    0.223856
32    0.113559
33    0.038239
dtype: float64

In [17]:
type (ser)

pandas.core.series.Series

## To make a new dataframe

In [18]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [19]:
newdf.head()

          0         1         2         3         4
0  0.337269  0.931343  0.284072  0.453154  0.623630
1  0.215166  0.966952  0.372151  0.673929  0.102104
2  0.243798  0.342572  0.956810  0.368820  0.870364
3  0.710989  0.522714  0.369046  0.745321  0.853033
4  0.228563  0.086343  0.220168  0.126385  0.979580

In [20]:
type(newdf)

pandas.core.frame.DataFrame

## To change the dara type

In [21]:
# newdf[0][0] = "bubu"

In [22]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [23]:
newdf.head()

          0         1         2         3         4
0  0.337269  0.931343  0.284072  0.453154  0.623630
1  0.215166  0.966952  0.372151  0.673929  0.102104
2  0.243798  0.342572  0.956810  0.368820  0.870364
3  0.710989  0.522714  0.369046  0.745321  0.853033
4  0.228563  0.086343  0.220168  0.126385  0.979580

In [24]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

## How to convert a dataframe into numpy arrays

In [25]:
newdf.to_numpy()

array([[0.33726914, 0.93134258, 0.28407188, 0.45315417, 0.6236304 ],
       [0.21516607, 0.9669522 , 0.37215096, 0.67392914, 0.10210398],
       [0.24379758, 0.34257192, 0.9568097 , 0.36882037, 0.87036405],
       ...,
       [0.45660683, 0.83878464, 0.62335629, 0.65258888, 0.40772918],
       [0.39228249, 0.24609097, 0.72085474, 0.84046027, 0.30549666],
       [0.10591757, 0.19041764, 0.05160152, 0.77655843, 0.50162055]])

## Transpose (convert rows into columns and vice versa)

In [26]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.337269,0.215166,0.243798,0.710989,0.228563,0.906581,0.439278,0.549065,0.183105,0.223202,...,0.812470,0.379556,0.861420,0.940333,0.720512,0.658816,0.635817,0.456607,0.392282,0.105918
1,0.931343,0.966952,0.342572,0.522714,0.086343,0.310312,0.191996,0.976133,0.138109,0.647870,...,0.547983,0.706129,0.638235,0.792203,0.403547,0.329833,0.333891,0.838785,0.246091,0.190418
2,0.284072,0.372151,0.956810,0.369046,0.220168,0.167106,0.193798,0.678132,0.258272,0.477245,...,0.202302,0.574728,0.858805,0.516647,0.639682,0.125303,0.383963,0.623356,0.720855,0.051602
3,0.453154,0.673929,0.368820,0.745321,0.126385,0.918570,0.388819,0.177681,0.343830,0.563145,...,0.390923,0.167606,0.344182,0.152613,0.111780,0.990887,0.269428,0.652589,0.840460,0.776558
4,0.623630,0.102104,0.870364,0.853033,0.979580,0.086917,0.601993,0.009017,0.783134,0.777157,...,0.239734,0.960484,0.668246,0.851967,0.330575,0.163258,0.834897,0.407729,0.305497,0.501621

## Sort the dataframe upside down

In [27]:
newdf.sort_index(axis=0, ascending=False).head()  # axis=0 : Row, axis=1 : column

            0         1         2         3         4
333  0.105918  0.190418  0.051602  0.776558  0.501621
332  0.392282  0.246091  0.720855  0.840460  0.305497
331  0.456607  0.838785  0.623356  0.652589  0.407729
330  0.635817  0.333891  0.383963  0.269428  0.834897
329  0.658816  0.329833  0.125303  0.990887  0.163258

In [28]:
newdf[0]

0      0.337269
1      0.215166
2      0.243798
3      0.710989
4      0.228563
         ...
329    0.658816
330    0.635817
331    0.456607
332    0.392282
333    0.105918
Name: 0, Length: 334, dtype: float64